<template>
  <div class="page-wrapper">
    <q-page class="q-pa-md">
      <h1 class="text-h4 q-mb-md">Рекламные возможности на LifeCourse</h1>
      <p>
        На LifeCourse мы предлагаем разнообразные рекламные возможности, которые помогают брендам достигать нашей активной аудитории студентов и профессионалов, заинтересованных в образовании и саморазвитии. На этой странице вы найдете информацию о том, как можно разместить вашу рекламу на нашем сайте.
      </p>

      <h2 class="text-h5 q-mt-md q-mb-sm">Почему стоит рекламироваться на LifeCourse</h2>
      <p>LifeCourse предоставляет уникальную аудиторию, заинтересованную в образовательных ресурсах и карьерном росте, что делает наш сайт идеальным местом для рекламы учебных программ, книг, технологий и многого другого.</p>

      <h2 class="text-h5 q-mt-md q-mb-sm">Варианты рекламы</h2>
      <ul>
        <li>Баннерная реклама</li>
        <li>Спонсируемые посты</li>
        <li>Реклама в рассылках</li>
        <li>Партнерские программы</li>
      </ul>

      <h2 class="text-h5 q-mt-md q-mb-sm">Таргетинг и аналитика</h2>
      <p>Мы предлагаем продвинутые решения для таргетинга вашей рекламы, включая демографический таргетинг, таргетинг по интересам и поведенческий таргетинг. Также мы предоставляем подробную аналитику о эффективности вашей рекламной кампании.</p>

      <h2 class="text-h5 q-mt-md q-mb-sm">Как начать</h2>
      <p>Для начала сотрудничества и размещения рекламы на LifeCourse, пожалуйста, свяжитесь с нашим отделом по рекламе по адресу <a href="mailto:advertising@lifecourse.com">advertising@lifecourse.com</a>.</p>
    </q-page> 
  </div>
</template>

<script lang="ts" setup>
import { QPage } from 'quasar'
</script>

<style lang="scss" scoped>
h1, h2 {
  margin-bottom: 0.5em;
}

p {
  margin-top: 0;
  margin-bottom: 1em;
}

ul {
  padding-left: 20px;
  list-style-type: disc;
}

a {
  color: #1976D2; /* LifeCourse theme color */
}
</style>
