<template>
  <div class="page-wrapper"> 
    <q-page class="q-pa-md">
      <h1 class="text-h4 q-mb-md">Политика конфиденциальности LifeCourse</h1>
      <ol>
        <li>
          <span class="text-h6 q-mt-md q-mb-sm">Введение</span>
          <p>Добро пожаловать на LifeCourse! Эта политика конфиденциальности направлена на то, чтобы объяснить, как мы собираем, используем и защищаем вашу личную информацию. Используя наши услуги, вы принимаете условия данной политики.</p>
        </li>
        <li>
          <span class="text-h6 q-mt-md q-mb-sm">Сбор информации</span>
          <p>Мы собираем информацию, которую вы предоставляете при регистрации на сайте, например, ваше имя, электронную почту и контактные данные. Кроме того, мы автоматически собираем данные о вашем использовании наших услуг, такие как IP-адрес и информация о браузере.</p>
        </li>
        <li>
          <span class="text-h6 q-mt-md q-mb-sm">Использование информации</span>
          <p>Собранная информация используется для предоставления и улучшения наших услуг, общения с вами, ответов на ваши запросы, а также для информирования о новых курсах или изменениях услуг.</p>
        </li>
        <li>
          <span class="text-h6 q-mt-md q-mb-sm">Раскрытие информации третьим лицам</span>
          <p>Мы не продаем, не обмениваем и не передаем вашу личную информацию третьим лицам. Это не относится к доверенным сторонам, которые помогают нам в ведении сайта, проведении бизнеса или обслуживании вас, пока эти стороны соглашаются с этой информацией в тайне.</p>
        </li>
        <li>
          <span class="text-h6 q-mt-md q-mb-sm">Безопасность данных</span>
          <p>Мы принимаем различные меры безопасности для защиты ваших личных данных, включая шифрование и аутентификацию.</p>
        </li>
        <li>
          <span class="text-h6 q-mt-md q-mb-sm">Права пользователей</span>
          <p>Вы имеете право в любое время запросить доступ к своим данным, их исправление, обновление или удаление. Для этого свяжитесь с нами по указанной ниже контактной информации.</p>
        </li>
        <li>
          <span class="text-h6 q-mt-md q-mb-sm">Изменения в политике</span>
          <p>Мы можем периодически обновлять эту политику. При внесении изменений мы уведомим вас путем обновления даты в начале этого документа и, при значительных изменениях, через платформу или по электронной почте.</p>
        </li>
        <li>
          <span class="text-h6 q-mt-md q-mb-sm">Контактная информация</span>
          <p>Если у вас есть вопросы о нашей политике конфиденциальности, пожалуйста, свяжитесь с нами по адресу support@lifecourse.com.</p>
        </li>
      </ol>
    </q-page>
  </div>
</template>

<script lang="ts" setup>
import { QPage } from 'quasar'
</script>

<style scoped>
ol {
  counter-reset: section;
  list-style-type: none;
  padding: 0;
}
li::before {
  counter-increment: section;
  content: counter(section) ". ";
  font-weight: bold;
}
</style>
